[
    [
        "Image Count",
        4
    ],
    [
        "Title",
        "GigaMIMO-5G™ Ultra High Gain 5G/4G/3G Outdoor/Marine MIMO/Dual Antenna for {modem}, Omnidirectional Diversity/Aux Enclosed ±45° Polarization by WirEng®"
    ],
    [
        "Description",
        "GigaMIMO-5G™ for {modem} by WirEng® is a powerful, innovative, ultra-wide band, true MIMO antenna (±45° polarizations as per MIMO standards) especially suitable for the marine environment.\nThe GigaMIMO-5G™ has its elements enclosed and sealed to protect its performance even in harsh environments, and has a practically omnidirectional radiation pattern.\nSince GigaMIMO-5G™ for {modem} is high gain and omnidirectional, it is especially suitable for situations where the there are several service towers in different directions, or where aiming at a service tower is not practical, such as in moving locations or when a user is located between multiple service towers.\nThe GigaMIMO-5G™ gain-power comes from eight state of the art 5G antennas and high-efficiency combiners, featuring ultra-linear response on all frequencies, to support all cellular/data carriers worldwide, even for the upcoming 5G standard! \nGigaMIMO-5G™ for {modem} now features 24K gold plated connectors and stainless steel mounts and back shields, for even higher performance and strength, with an unprecedented 450 MHz to 6000 MHz (0.45 GHz to 6 GHz) frequency range, which is impossible to find in any other antenna in the market today.\nGigaMIMO-5G™ for {modem} is great for carrier aggregation and ultra-carrier aggregation modems/routers and is also suitable as a rooftop antenna and for in-field applications (newscasting, camping, emergency response teams, etc.). This GigaMIMO-5G™ bundle will connect directly to the {modem} modem (assembly required).\nGigaMIMO-5G™ for {modem} bundle is made one by one with highly skilled craftsmanship and include a one-year warranty period. Patent pending."
    ],
    [
        "Main Benefits and Features",
        "This GigaMIMO-5G™ bundle will connect directly to the {modem}, taking full advantage of its advanced MIMO feature (±45° polarizations as per MIMO standards) and is especially suitable for the marine environment.\nGigaMIMO-5G™ gain-power comes from eight state of the art 5G antennas and high-efficiency combiners. GigaMIMO-5G™ for {modem} by WirEng® is a true 5G antenna because it covers all 5G cellular bands between 450 MHz and 6 GHz.\nThe GigaMIMO-5G™ now features 24K gold plated connectors and stainless steel mounts and back shields, for even higher performance and strength, and supports all cellular/data carriers worldwide. GigaMIMO-5G™ for {modem} is great for ultra-carrier aggregation modems/routers and is also suitable as a rooftop antenna or for newscasting, camping, emergency response teams, etc.\nGigaMIMO-5G™ for {modem} operating frequency range is 450-6000 MHz with a peak gain of (varies) dBi*, a horizontal aperture of 360° and a vertical aperture of 60°. This GigaMIMO-5G™ system is made for the {modem} and is mainly recommended for Outdoors (Pole) applications.\n*Gain in dBi values are average increases obtained by comparing the standard/internal device antenna to a properly-installed GigaMIMO-5G™ located substantially higher than the {modem} location.\nGigaMIMO-5G™ for {modem} itself measures 37.2 x 30.5 x 37.2 inches and weighs 18.6 lbs. One year manufacturer warranty included. Patent pending."
    ],
    [
        "Model",
        "GigaMIMO-5G™"
    ]
]