[
    [
        "Image Count",
        9
    ],
    [
        "Title",
        "Omnirial2-Plus-5G™ True MIMO ±45° 5G/4G/3G High Gain Antenna for {modem} by WirEng®"
    ],
    [
        "Description",
        "The Omnirial2-Plus-5G™ by WirEng® is a higher gain, omnidirectional, fully enclosed, all-weather, true MIMO (+45° and -45° wave polarizations) antenna for outdoor/pole/mast installations. The Omnirial2-Plus-5G™ can withstand harsh environments and is fully sealed and all-weather protected. Omnirial2-Plus-5G™ set is made for the {modem} and comes with 30 feet of dual WRG400 ultra-low loss coaxial cable with the correct connector/adapter for the {modem}. Omnirial2-Plus-5G™ set is made one by one with highly skilled craftsmanship and include a one-year warranty period."
    ],
    [
        "Main Features and Benefits",
        "The Omnirial2-Plus-5G™ is a true MIMO (±45° polarizations), higher gain dual antenna made to enhance your {modem} signal and SINR/CINR. For best results, simply install the Omnirial2-Plus-5G™ on a standard TV antenna pole (1.25 inch diameter recommended) as high as possible, run the included cables to your {modem}, and enjoy the better signal and faster throughput!\nOmnirial2-Plus-5G™ system will connect directly to your {modem}, supporting all its frequency bands and modes of operation. It is recommended even when your signal is not too low because its dual ±45° polarization antenna elements will increase the signal-to-noise (SINR/CINR) ratio for better download and upload data rates!\nOmnirial2-Plus-5G™ system is specifically effective with the 5G/4G signal, but will also work with 3G as long as your device allows it. set, made for enhancing the {modem} signal strength and data throughput, includes the Omnirial2-Plus-5G™ and 30 feet of dual WRG400 ultra-low loss coaxial cable for direct connection to the {modem}.\nThe Omnirial2-Plus-5G™ operating frequency range is 690-3800 MHz with a peak gain of (varies) dBi*, a horizontal aperture of 360° and a vertical aperture of 70°. Omnirial2-Plus-5G™ system is made for the {modem} (SKU ATT-NH5100-OMP2) and is mainly recommended for Outdoors (Pole) applications.\n*Gain in dBi values are average increases obtained by comparing the standard/internal device antenna to a properly-installed Omnirial2-Plus-5G™ located substantially higher than the {modem} location. The Omnirial2-Plus-5G™ itself measures 4.2 x 30.3 x 8.5 inches and weighs 4.2 lbs. One year manufacturer warranty included."
    ],
    [
        "Model",
        "Omnirial2-Plus-5G™"
    ],
    [
        [
            "Distributor",
            "BestCellDist"
        ],
        [
            "Link",
            "https://bestcelldist.com/search?q=omnirial2-plus-5g"
        ]
    ]
]