[
    [
        "Image Count",
        30
    ],
    [
        "Title",
        "WideAnt2-5G™ 5G and 4G Dual Antenna for {modem} True MIMO High-Gain Ultra-Wide Band ±45° Polarizations 24K Gold Plated Connectors by WirEng®"
    ],
    [
        "Description",
        "WideAnt2-5G™ for {modem} by WirEng® is a 5G and 4G true ±45° MIMO (45° clockwise and 45° counter-clockwise wave polarizations), fully enclosed, all-weather, ultra-linear, larger dual antenna for outdoor/pole/mast installations.\nWideAnt2-5G™ for {modem} represents a true technological breakthrough as one of the widest-band antennas in the world as of today. WideAnt2-5G™ for {modem} can be used with a variety of 5G, 4G, 3G, and 2G radio equipment systems, including MIMO modems, hotspots, and routers (as external antennas) and with many other applications in the 450MHz to 6000MHz range\n WideAnt2-5G™ for {modem} is fully enclosed and all-weather resistant, and is ideal for MIMO devices because it captures and transmits waves in two different polarization modes, as per MIMO-devices standards. WideAnt2-5G™ for {modem} can also be used with other dual-antenna-port devices such as Aux/Diversity devices.\nThe connectors on WideAnt2-5G™ for {modem} are 24K gold-plated N female for maximum bandwidth and power transfer. Industrial-strength stainless steel Single-to-Dual antenna pole mount adapter included. One-year warranty period included."
    ],
    [
        "Main Features and Benefits",
        "WideAnt2-5G™ for {modem} is an elegant, larger, fully enclosed, powerful directional Dual antenna that truly captures and transmits both +45° and -45° waves independently, as per strict MIMO standards (two cables required to connect to a MIMO device not included).\nWideAnt2-5G™ features 24K gold plated N-Female connectors built directly on the antennas' bodies for maximum power transfer and bandwidth, and includes WirEng®'s excusive industrial-strength, stainless steel single-to-dual pole adapter (pole/mast not included).\nWideAnt2-5G™for {modem} can be used with 5G and 4G MIMO modems, hotspots, routers, and M2M devices (device-specific adapters not included). WideAnt2-5G™ for {modem} is compatible with virtually all cellular bands worldwide and represents a true breakthrough in antenna technology because of its ultra-wide bandwidth and efficiency.\nWideAnt2-5G™ operating frequency range is 450-6000 MHz with a peak gain of (varies) dBi*, a horizontal aperture of (varies)° and a vertical aperture of (varies)°. The connectors are N Female (24K Au). The nominal impedance is 50/75 Ohm (SKU WDG2-5G-UNI).\nWideAnt2-5G™  for {modem} is mainly recommended for outdoors (pole/mast) applications.\n*Gain in dBi values are averages increases obtained by comparing the standard/internal device antenna to a properly-installed WideAnt2-5G™ located substantially higher than the device location.\nWideAnt2-5G™ measures 17.5 x 9.2 x 21 inches and weighs 5.7 lbs. Made one by one with highly skilled craftsmanship. One year manufacturer warranty included."
    ],
    [
        "Model",
        "WideAnt2-5G™"
    ],
    [
        [
            "Distributor",
            "BestCellDist"
        ],
        [
            "Link",
            "https://bestcelldist.com/search?q=wideant2-5g"
        ]
    ]
]